soap/LEMS_DQ_2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<m1:SendLEMSRequest xmlns:m1="http://jnet.state.pa.us/message/jnet/LEMSRequestProxy/1">
			<jnet-m:RequestMetadata xmlns:jnet-m="http://www.jnet.state.pa.us/niem/jnet/metadata/1">
				<jnet-m:UserDefinedTrackingID>DI11325043</jnet-m:UserDefinedTrackingID>
				<jnet-m:RequestAgencyORIID>PA022035Y</jnet-m:RequestAgencyORIID>
				<jnet-m:RequestAttentionName>JNET</jnet-m:RequestAttentionName>
				<jnet-m:RequestPurposeCode>C</jnet-m:RequestPurposeCode>
				<jnet-m:RequestReasonText>JNET WS Monitoring App Query</jnet-m:RequestReasonText>
				<jnet-m:RequestUserID>H02293184</jnet-m:RequestUserID>
				<jnet-m:RequestDataSourceID>DQ</jnet-m:RequestDataSourceID>
				<jnet-m:RequestDestinationID>B1</jnet-m:RequestDestinationID>
				<jnet-m:RequestDestinationID>WV</jnet-m:RequestDestinationID>
				<jnet-m:RequestDestinationID>VA</jnet-m:RequestDestinationID>
				<jnet-m:RequestDestinationID>OH</jnet-m:RequestDestinationID>
			</jnet-m:RequestMetadata>
			<jc:PersonSearchCriteria xmlns:jc="http://www.jnet.state.pa.us/niem/JNET/jnet-core/1">
				<nc:PersonName xmlns:nc="http://niem.gov/niem/niem-core/2.0" xmlns:s="http://niem.gov/niem/structures/2.0">
					<nc:PersonGivenName>JNET</nc:PersonGivenName>
					<nc:PersonSurName>TESTRECORD</nc:PersonSurName>
				</nc:PersonName>
				<nc:PersonBirthDate xmlns:nc="http://niem.gov/niem/niem-core/2.0" xmlns:s="http://niem.gov/niem/structures/2.0">
					<nc:Date>1980-01-01</nc:Date>
				</nc:PersonBirthDate>
				<nc:PersonSexCode xmlns:nc="http://niem.gov/niem/niem-core/2.0">M</nc:PersonSexCode>
			</jc:PersonSearchCriteria>
		</m1:SendLEMSRequest>
	</soapenv:Body>
</soapenv:Envelope>